def w2n(a):
    units = {"ноль":0, "один":1, "два":2, "три":3, "четыре":4, "пять":5, "шесть":6, "семь":7, "восемь":8,
            "девять":9,  "одиннадцать":11, "двенадцать":12, "тринадцать":13, "четырнадцать":14, "пятнадцать":15,
            "шестнадцать":16, "семнадцать":17, "восемнадцать":18, "девятнадцать":19,"десять":10,"двадцать":20, "тридцать":30, "сорок":40, "пятьдесят":50, "шестьдесят":60, "семьдесят":70, "восемьдесят":80, "девяносто":90}
    tens = {"десять":10,"двадцать":20, "тридцать":30, "сорок":40, "пятьдесят":50, "шестьдесят":60, "семьдесят":70, "восемьдесят":80, "девяносто":90}
    n=''
    b=''
    for i in a.split():
        if i in tens:
            b=units.get(i)
            continue
        else:
            if b!='':
                n+=str(b+units.get(i))
                b=''
            else:
                n+=str(units.get(i))
    return n

s=input()
#print(s)
for i in range(len(s)):
    if s[i]=='плюс':
        s[i]='+'
    elif s[i]=='минус':
        s[i]='-'
    elif s[i]=='умножить на':
        s[i]='*'
    elif s[i]=='поделить на':
        s[i]='/'
    else:
        s[i]=str(w2n(s[i]))
#print(s)
print(w2n(s))
'''
if 'плюс' in s:
    s=s.split('плюс')
    print(w2n(s[0])+w2n(s[1]))
elif 'минус' in s:
    s=s.split('минус')
    print(w2n(s[0])-w2n(s[1]))
elif 'умножить на' in s:
    s=s.split('умножить на')
    print(w2n(s[0])*w2n(s[1]))
elif 'поделить на' in s:
    s=s.split('поделить на')
    print(w2n(s[0])/w2n(s[1]))
'''
