def w2n(a):
    units = {"ноль":0, "один":1, "два":2, "три":3, "четыре":4, "пять":5, "шесть":6, "семь":7, "восемь":8,
            "девять":9,  "одиннадцать":11, "двенадцать":12, "тринадцать":13, "четырнадцать":14, "пятнадцать":15,
            "шестнадцать":16, "семнадцать":17, "восемнадцать":18, "девятнадцать":19,"десять":10,"двадцать":20, "тридцать":30, "сорок":40, "пятьдесят":50, "шестьдесят":60, "семьдесят":70, "восемьдесят":80, "девяносто":90}
    #tens = {"двадцать":20, "тридцать":30, "сорок":40, "пятьдесят":50, "шестьдесят":60, "семьдесят":70, "восемьдесят":80, "девяносто":90}
    n=''
    b=''
    for i in a.split():
        if i in units:
            b=units.get(i)
            continue
        else:
            if b!='':
                n+=str(b+units.get(i))
                b=''
            else:
                n+=str(units.get(i))
    return n
print(w2n("десять"))